GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*定位数据的地址?
   从指定的结束时间之前最近的第1分钟的行驶速度记录开始
   要不要传递进nodedata?
   准备要发送的数据，约束条件:开始结束时刻，总的block数

 */
void vdr_08_get_ready( MYTIME start, MYTIME end, uint16_t totalrecord )
{
	uint32_t			addr;
	JT808_TX_NODEDATA	*pnodedata;
	VDR_08_USERDATA		*puserdata;
	uint32_t			i;
	uint16_t			rec_count = 0;              /*找到的记录数*/
	uint8_t				buf[126 * 4];

	uint32_t			addr_from	= 0xFFFFFFFF;   /*开始的地址*/
	uint32_t			addr_to		= 0xFFFFFFFF;   /*结束的地址*/

	uint32_t			time_from	= 0xFFFFFFFF;   /*上报记录 开始的时刻，最近的*/
	uint32_t			time_to		= 0xFFFFFFFF;   /*上报记录 结束的时刻，最远的*/

	MYTIME				mytime;

/*从当前位置开始逆序查找*/
	start	&= 0xFFFFFFC0;                          /*忽略秒*/
	end		&= 0xFFFFFFC0;

	rt_kprintf( "%d>开始遍历数据\r\n", rt_tick_get( ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	addr = vdr_08_addr + 128;                       /*判断中做了地址递减*/
	for( i = 0; i < VDR_08_SECTORS * 32; i++ )      /*总共找的记录数，完全使用地址判断会不方便*/
	{
		addr -= 128;
		if( addr < VDR_08_START )                   /*环回*/
		{
			addr = VDR_08_END - 128;
		}
		sst25_read( addr, buf, 4 );
		mytime = (uint32_t)( buf[0] << 24 ) | (uint32_t)( buf[1] << 16 ) | (uint32_t)( buf[2] << 8 ) | (uint32_t)( buf[3] );
		if( mytime == 0xFFFFFFFF )
		{
			continue;                                   /*不是有效记录继续查找*/
		}
		mytime &= 0xFFFFFFC0;                           /*忽略秒,对应到分钟*/
		if( ( mytime <= end ) && ( mytime >= start ) )  /*是在时间段内[0..0xffffffff]*/
		{
			rec_count++;                                /*有效记录*/
			if( rec_count >= totalrecord )              /*收到足够的记录数*/
			{
				break;
			}
			if( time_from == 0xFFFFFFFF )               /*记录开始的地址,第一个找到的就是最近的*/
			{
				time_from	= mytime;
				addr_from	= addr;
			}
			if( mytime < time_to )                      /*逆序*/
			{
				time_to = mytime;
				addr_to = addr;
			}
		}
	}

	rt_sem_release( &sem_dataflash );

	rt_kprintf( "%d>遍历结束(%d条) form:%08x to:%08x\r\n", rt_tick_get( ), rec_count, addr_from, addr_to );

/*默认按多包分配*/
	puserdata = rt_malloc( sizeof( VDR_08_USERDATA ) );
	if( puserdata == RT_NULL )
	{
		return;
	}
	puserdata->record_total		= rec_count;
	puserdata->record_remain	= rec_count;
	puserdata->addr_from		= addr_from;
	puserdata->addr_to			= addr_to;
	puserdata->addr				= addr_from;
	puserdata->packet_total		= ( rec_count + 3 ) / 4; /*每四条记录形成一包*/
	puserdata->packet_curr		= 0;

	pnodedata = node_begin( 1, MULTI, 0x0700, 0xF000, 126 * 4 + 7 );
	if( pnodedata == RT_NULL )
	{
		rt_free( puserdata );
		puserdata = RT_NULL;
		rt_kprintf( "无法分配\r\n" );
	}
	pnodedata->user_para		= puserdata;
	pnodedata->cb_tx_timeout	= vdr_08_tx_timeout;
	pnodedata->cb_tx_response	= vdr_08_tx_response;
	vdr_08_fill_data( pnodedata );
	node_end( pnodedata );
}

FINSH_FUNCTION_EXPORT_ALIAS( vdr_08_get_ready, get_08, get_08_data );


/*
   单位小时内每分钟的位置信息和速度
   最快频率，每分钟一组数据
   360小时=15天
   每天4个sector 每个sector对应6小时，每小时  680字节





 */
void vdr_09_init( void )
{
	uint32_t	addr, addr_max = 0xFFFFFFFF;
	uint8_t		find = 0;
	uint8_t		buf[32];
	uint32_t	mytime_curr		= 0;
	uint32_t	mytime_vdr_09	= 0;

	uint16_t	sector	= 0;
	uint8_t		count	= 0;

	for( vdr_09_sect = 0; vdr_09_sect < VDR_09_SECTORS; vdr_09_sect++ )
	{
		addr = VDR_09_START + vdr_09_sect * 4096;
		for( count = 0; count < 6; count++ )                                                /*每扇区6条记录*/
		{
			sst25_read( addr, buf, 4 );
			mytime_curr = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];   /*前4个字节代表时间*/
			if( mytime_curr != 0xFFFFFFFF )                                                 /*是有效记录*/
			{
				if( mytime_curr >= mytime_vdr_09 )
				{
					vdr_09_time			= mytime_curr;
					vdr_09_sect_index	= count;
				}
			}
			addr += 680;
		}
	}
	rt_kprintf( "%d>vdr_09 sect=%08x datetime=%08x sect_index=%d\r\n", rt_tick_get( ), vdr_09_sect, vdr_09_time, vdr_09_sect_index );
}

/*
   每扇区存6个小时的数据
   一个小时666byte 占用680byte
 */
void vdr_09_put( MYTIME datetime )
{
	uint8_t		buf[16], bufhead[10];
	uint32_t	i;
	uint32_t	addr;
	uint8_t		minute;

	if( ( vdr_09_time & 0xFFFFFFC0 ) == ( datetime & 0xFFFFFFC0 ) ) /*在同一分钟内*/
	{
		return;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	if( ( vdr_09_time & 0xFFFFF000 ) != ( datetime & 0xFFFFF000 ) ) /*不是是在当前的小时内,新纪录*/
	{
		vdr_09_sect_index++;                                        /*要写入新的小时记录每680字节*/
		if( vdr_09_sect_index > 5 )                                 /*每个sector存6个小时 0-5,越过一个扇区*/
		{
			vdr_09_sect_index = 0;
			vdr_09_sect++;
			if( vdr_09_sect >= VDR_09_SECTORS )
			{
				vdr_09_sect = 0;
			}
			addr = VDR_09_START + vdr_09_sect * 4096;
			sst25_erase_4k( addr );
		}

		addr = VDR_09_START + vdr_09_sect * 4096 + vdr_09_sect_index * 680; /*每扇区680字节*/
		PACK_INT( bufhead, ( datetime & 0xFFFFF000 ) );                     /*写入新的记录头*/
		bufhead[4]	= HEX2BCD( YEAR( datetime ) );
		bufhead[5]	= HEX2BCD( MONTH( datetime ) );
		bufhead[6]	= HEX2BCD( DAY( datetime ) );
		bufhead[7]	= HEX2BCD( HOUR( datetime ) );
		bufhead[8]	= 0;
		bufhead[9]	= 0;
		sst25_write_through( addr, bufhead, 10 );
	}

	PACK_INT( buf, ( gps_longi * 6 ) );
	PACK_INT( buf + 4, ( gps_lati * 6 ) );
	PACK_WORD( buf + 8, ( gps_alti ) );
	buf[10] = gps_speed;

	minute	= MINUTE( datetime );
	addr	= VDR_09_START + vdr_09_sect * 4096 + vdr_09_sect_index * 680 + minute * 11 + 10; /*跳到指定的位置,开始有10字节头*/
	sst25_write_through( addr, bufhead, 11 );
	rt_sem_release( &sem_dataflash );
	vdr_09_time = datetime;
	rt_kprintf( "%d>save 09 data addr=%08x\r\n", rt_tick_get( ), addr );
}

/*读取数据*/
JT808_MSG_STATE vdr_09_fill_data( JT808_TX_NODEDATA *pnodedata )
{
}

/*收到应答的处理函数*/
static void vdr_09_tx_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
	vdr_09_fill_data( nodedata );
}

/*超时后的处理函数*/
static void vdr_09_tx_timeout( JT808_TX_NODEDATA * nodedata )
{
	vdr_09_fill_data( nodedata );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void vdr_09_get_ready( MYTIME start, MYTIME end, uint16_t totalrecord )
{
	uint32_t			addr;
	JT808_TX_NODEDATA	*pnodedata;
	VDR_08_USERDATA		*puserdata;
	uint32_t			i;
	uint16_t			rec_count = 0; /*找到的记录数*/
	uint8_t				buf[126 * 4];

