GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
	uint8_t				sector;
	uint8_t				index;

	uint8_t				sector_from=0xFF;
	uint8_t				index_from;
	uint32_t			time_from=0xFFFFFFFF;

	uint8_t				sector_to;
	uint8_t				index_to;
	uint32_t			time_to=0xFFFFFFFF;

	MYTIME				mytime;

	/*从当前位置开始逆序查找*/
	start	&= 0xFFFFF000;                                  /*忽略分秒*/
	end		&= 0xFFFFF000;

	rt_kprintf( "%d>开始遍历数据\r\n", rt_tick_get( ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );

	sector	= vdr_09_sect;                                  /*从当前位置开始查找*/
	index	= 5;
	for( i = 0; i < VDR_09_SECTORS; i++ )                   /*就是一个计数*/
	{
		addr = VDR_09_START + sector * 4096 + index * 680;  /*找到每个小时头*/
		sst25_read( addr, buf, 4 );
		mytime = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
		if( ( mytime >= start ) && ( mytime <= end ) )	/*在有效时间段内*/
		{
			if(time_from==0xFFFFFFFF)	/*第一个找到的就是最近的*/
			{
				sector_from=sector;
				index_from=index;
			}
			if(mytime<=time_to)
			{
				sector_to=sector;
				index_to=index;
			}
			rec_count++;
		}

		if( index == 0 )
		{
			index = 6;	/*下面做了递减*/
			if( sector == 0 )
			{
				sector = VDR_09_SECTORS;
			}
			sector--;
		}
		index--;
	}
	rt_sem_release( &sem_dataflash );

	rt_kprintf( "%d>遍历结束(%d条) FROM %d:%d TO %08x\r\n", rt_tick_get( ), rec_count, sector_from,index_from, sector_to,index_to );
#if 0
	/*默认按多包分配*/
	puserdata = rt_malloc( sizeof( VDR_08_USERDATA ) );
	if( puserdata == RT_NULL )
	{
		return;
	}
	puserdata->record_total		= rec_count;
	puserdata->record_remain	= rec_count;
	puserdata->addr_from		= addr_from;
	puserdata->addr_to			= addr_to;
	puserdata->addr				= addr_from;
	puserdata->packet_total		= ( rec_count + 3 ) / 4;        /*每四条记录形成一包*/
	puserdata->packet_curr		= 0;

	pnodedata = node_begin( 1, MULTI, 0x0700, 0xF000, 126 * 4 + 7 );
	if( pnodedata == RT_NULL )
	{
		rt_free( puserdata );
		puserdata = RT_NULL;
		rt_kprintf( "无法分配\r\n" );
	}
	pnodedata->user_para		= puserdata;
	pnodedata->cb_tx_timeout	= vdr_08_tx_timeout;
	pnodedata->cb_tx_response	= vdr_08_tx_response;
	vdr_08_fill_data( pnodedata );
	node_end( pnodedata );
#endif	
}


/*
   收到gps数据的处理，有定位和未定位
   存储位置信息，
   速度判断，校准
 */

rt_err_t vdr_rx_gps( void )
{
	uint32_t	datetime;
	uint8_t		year, month, day, hour, minute, sec;
	uint32_t	i;
	uint8_t		buf[128];
	uint8_t		*pbkpsram;

#ifdef TEST_BKPSRAM
/*上电后，有要写入的历史数据 08*/
	if( *(__IO uint8_t*)( BKPSRAM_BASE ) == 1 )
	{
		pbkpsram = (__IO uint8_t*)BKPSRAM_BASE + 1;
		for( i = 0; i < 128; i++ )
		{
			buf[i] = *pbkpsram++;
		}

		*(__IO uint8_t*)( BKPSRAM_BASE ) = 0;
	}
#endif

	if( ( jt808_status & BIT_STATUS_GPS ) == 0 )                /*未定位*/
	{
		return;
	}

	year	= gps_datetime[0];
	month	= gps_datetime[1];
	day		= gps_datetime[2];
	hour	= gps_datetime[3];
	minute	= gps_datetime[4];
	sec		= gps_datetime[5];
	//rt_kprintf( "%d>vdr_rx=%02d-%02d-%02d %02d:%02d:%02d\r\n", rt_tick_get( ), year, month, day, hour, minute, sec );

	datetime = MYDATETIME( year, month, day, hour, minute, sec );

	vdr_08_put( datetime, gps_speed, vdr_signal_status );


/*
   09数据 单位小时内每分钟的位置速度，只保存第一次有效的
   每小时(10+1)*60+6 字节
 */
	//vdr_09_put( datetime );

/*10数据 事故疑点*/
	if( car_status.status == 0 )                                        /*认为车辆停止,判断启动*/
	{
		if( gps_speed >= SPEED_LIMIT )                                  /*速度大于门限值*/
		{
			car_status.gps_judge_duration++;
			if( car_status.gps_judge_duration >= SPEED_LIMIT_DURATION ) /*超过了持续时间*/
			{
				car_status.gps_duration			= SPEED_LIMIT_DURATION;
				car_status.status				= 1;                    /*认为车辆行驶*/
				car_status.gps_judge_duration	= 0;
				rt_kprintf( "%d>车辆行驶\r\n", rt_tick_get( ) );
			}else
			{
				car_status.gps_duration++;                              /*停车累计时间*/
			}
		}else
		{
			car_status.gps_duration++;                                  /*停车累计时间*/
			                                                            /*在此判断停车超时*/
			car_status.gps_judge_duration = 0;
		}
	}else                                                               /*车辆已启动*/
	{
		if( gps_speed <= SPEED_LIMIT )                                  /*速度小于门限值*/
		{
			car_status.gps_judge_duration++;
			if( car_status.gps_judge_duration >= SPEED_LIMIT_DURATION ) /*超过了持续时间*/
			{
				car_status.gps_duration			= SPEED_LIMIT_DURATION;
				car_status.status				= 0;                    /*认为车辆停驶*/
				car_status.gps_judge_duration	= 0;
				rt_kprintf( "%d>车辆停驶\r\n", rt_tick_get( ) );
			}else
			{
				car_status.gps_duration++;                              /*行驶累计时间*/
			}
		}else
		{
			car_status.gps_duration++;                                  /*行驶累计时间*/
			                                                            /*判断疲劳驾驶*/
			car_status.gps_judge_duration = 0;
		}
	}

/*11数据超时驾驶记录*/
}


#if 0
/*
   删除特定区域的记录数据
   使用bitmask是不是更好
 */
void vdr_format( uint16_t area )
{
	uint8_t i;
	uint8_t sect;

	for( i = 8; i < 16; i++ )
	{
		if( area & ( 1 << i ) )
		{
			for( sect = 0; sect < sect_info[i - 8].sectors; sect++ )
			{
				sst25_erase_4k( sect_info[i - 8].start_addr + sect * 4096 );
			}
		}
	}
}

FINSH_FUNCTION_EXPORT( vdr_format, format vdr record );
#endif

/*
   获取08存储的状态 48小时 单位分钟内每秒的速度状态2byte
   48*60*128=2880*128=368640 (bytes)
   368640/4096=90(sectors)

   格式:
   <'8'><mydatetime(4bytes><60秒的速度状态120bytes>
   循环递增
 */


/*
   初始化记录区数据
   因为是属于固定时间段存储的
   需要记录开始时刻的sector位置(相对的sector偏移)
 */
rt_err_t vdr_init( void )
{
	uint8_t* pbuf;

	pulse_init( );                /*接脉冲计数*/

	//vdr_format( 0xff00 );

	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		return -RT_ENOMEM;
	}

	vdr_08_init( );
#if 0
	vdr_init_byid( 8, pbuf );
	sst25_read( sect_info[0].addr, (uint8_t*)&stu_rec_08, sizeof( STU_REC_08 ) );                /*读出来是防止一分钟内的重启*/
	vdr_init_byid( 9, pbuf );
	sst25_read( sect_info[1].addr, (uint8_t*)&stu_rec_09, sizeof( STU_REC_09 ) );
	vdr_init_byid( 10, pbuf );
	vdr_init_byid( 11, pbuf );
	vdr_init_byid( 12, pbuf );
	vdr_init_byid( 13, pbuf );
	vdr_init_byid( 14, pbuf );
	vdr_init_byid( 15, pbuf );
#endif
	rt_free( pbuf );
	pbuf = RT_NULL;
/*初始化一个50ms的定时器，用作事故疑点判断*/
	rt_timer_init( &tmr_200ms, "tmr_200ms",                     /* 定时器名字是 tmr_50ms */
	               cb_tmr_200ms,                                /* 超时时回调的处理函数 */
	               RT_NULL,                                     /* 超时函数的入口参数 */
	               RT_TICK_PER_SECOND / 5,                      /* 定时长度，以OS Tick为单位 */
	               RT_TIMER_FLAG_PERIODIC );                    /* 周期性定时器 */
	rt_timer_start( &tmr_200ms );
}

